Repository: ibrahim-s/trainingNvdaCommands
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: pt, ru, uk

source: Description:
pt: Descrição:
uk: Опис:

source: Training Keyboard Commands
pt: Treinar comandos de teclado
uk: Тренажер клавіатурних команд

source: Display training keyboard Commands game dialog.
pt: Mostrar o diálogo do jogo dos Comandos de treino de teclado.
ru: Показать диалог новой игры training keyboard Commands
uk: Показати діалог гри тренажера клавіатурних команд.

source: Training Nvda Commands
pt: Treino de comandos do Nvda
uk: Тренажер команд NVDA

source: Your Score: 0
pt: A sua pontuação: 0
ru: Ваши очки: 0
uk: Ваш результат: 0

source: Choose Option
pt: Escolha a opção
ru: Выберите правильный вариант
uk: Оберіть варіант

source: Desktop layout commands
pt: Comandos de teclado do computador de secretária
ru: Настольная
uk: Команди розкладки клавіатури Desktop

source: Laptop layout commands
pt: Comandos de teclado do computador portátil
ru: Ноутбук
uk: Команди розкладки Laptop

source: Choose keyboard layout to train commands
pt: Escolher o tipo do teclado para treinar comandos
ru: Выберите раскладку клавиатуры, чтобы приступить к изучению команд
uk: Оберіть розкладку клавіатури для тренування команд

source: Ok
ru: ОК
uk: Гаразд

source: Begin Play
pt: Começar a jogar
ru: Начать игру
uk: Розпочати гру

source: Exit
pt: Sair
ru: Выход
uk: Вихід

source: Do you want to save remaining questions from this round; so that you can resume them later?
pt: Pretende guardar as perguntas restantes desta ronda; para que as possa retomar mais tarde?
ru: Сохранить оставшиеся вопросы в этой игре? Вы сможете вернуться к ним позже.
uk: Бажаєте зберегти непройдені запитання з цього раунду; щоб змогти відновити їх пізніше?

source: Save Game
pt: Guardar o jogo
ru: Сохранить игру
uk: Зберегти гру

source: Your Score: {}/{}
pt: A sua pontuação: {}/{}
ru: Ваши очки: {}/{}
uk: Ваш результат: {}/{}

source: Wrong answer; No lose, go on.
pt: Resposta errada; Não perde, continua.
ru: Неправильный ответ; Но не опускайте руки, продолжайте игру!
uk: Неправильна відповідь; Та ви не програли, продовжуйте.

source: Error Message
pt: Mensagem de Erro
ru: Ошибка
uk: Повідомлення про помилку

source: Your Score: {}
pt: A sua pontuação: {}
uk: Ваш результат: {}

source: Congratulations; you have answered all questions and won; see you in another round or game.
pt: Parabéns; respondeste a todas as perguntas e ganhaste; vemo-nos noutra ronda ou jogo.
ru: Поздравляем! Вы ответили на все вопросы и выиграли! Увидимся в очередном раунде нашей игры.
uk: Вітаємо; ви відповіли на всі запитання і здобули перемогу. побачимося в наступному раунді або грі.

source: End Of Game
pt: Fim do jogo
ru: Конец игры
uk: Кінець гри

source: Choose layout and play again
pt: Selecionar o esquema de teclado e jogar novamente
ru: Выберите расскладку и играйте ещё
uk: Оберіть розкладку і зіграйте знову

source: Desktop layout
pt: Teclado de computador de secretária
uk: Розкладка Desktop

source: Laptop layout
pt: Teclado de computador portátil
uk: Розкладка Laptop

source: Questions preserved of previous round of same layout found, Do you want to resume the previous round?
pt: Foram encontradas perguntas preservadas da ronda anterior do mesmo esquema de teclado, Deseja retomar a ronda anterior?
ru: Обнаружена сохранённая игра с такой же раскладкой. Хотите продолжить?
uk: Виявлено запитання, збережені з попереднього раунду тієї ж розкладки, Бажаєте відновити попередній раунд?

source: Resume Game
pt: Resumo do Jogo
ru: Восстановить игру
uk: Відновити гру

source: Welcome To training nvda commands like game; We will ask you NVDA {} commands like questions; and you have to choose the right answer from the available options; Let us then begin!
pt: Bem-vindo ao jogo de treino de comandos do nvda; Vamos fazer-lhe perguntas do tipo comandos do NVDA {}; e tem de escolher a resposta certa entre as opções disponíveis; Vamos então começar!
ru: Добро пожаловать в игру "Training nvda commands"! Мы будем задавать вам клавиатурные команды NVDA, а вы должны выбрать верный вариант из списка. Итак, давайте начнём!
uk: Вітаємо у тренажері команд NVDA у вигляді гри; Ми будемо запитувати вас про команди {} в NVDA; а ви повинні обрати правильну відповідь із доступних варіантів; Розпочнімо!

source: Welcome
pt: Bem-vindo
ru: Добро пожаловать
uk: Вітаємо

source: Your score: {}/{}
pt: A sua pontuação: {}/{}
ru: Ваши очки: {}/{}
uk: Ваш результат: {}/{}

source: Training Keyboards Commands
pt: Treino de comandos dos teclados
uk: Тренажер клавіатурних команд

source: This addon allows you to train NVDA commands in game like way, for either desktop or laptop layout mode. For every commands and it's description, you have to choose the right keys or answer specific to it. And if exiting before the end, you can save the remaining questions to resume them in later time. In order to use the addon, you have to assign a gesture to it via NVDAmenu>preferences>inputGestures>trainingKeyboardCommands.
pt: Este extra permite-lhe treinar os comandos do NVDA de forma semelhante a um jogo, tanto no modo de teclado de computador de secretária como no de computador portátil. Para cada comando e respectiva descrição, tem de escolher as teclas correctas ou a resposta específica para o mesmo. E se sair antes do fim, pode guardar as perguntas restantes para as retomar mais tarde. Para utilizar o extra, tem de lhe atribuir um comando através do menu do NVDA>preferências>definir comandos>comandos de treino do teclado.
ru: Это дополнение позволяет вам изучать клавиатурные команды NVDA в игровом режиме как для настольной раскладки, так и для раскладки "ноутбук". для каждой команды вам нужно будет выбрать правильное сочетание клавиш, которое соответствует этой команде. Если вы закроете игру до завершения, вы сможете сохранить её, чтобы вернуться позже. Чтобы использовать дополнение, нужно назначить горячую клавишу в меню NVDA>параметры>жесты ввода>trainingKeyboardCommands.
uk: Цей додаток дозволяє вивчати команди NVDA в ігровій формі, як для розкладки клавіатури Desktop, так і для розкладки Laptop. Для кожної команди та її опису вам потрібно выбрати правильні клавіші або відповідь, яка їй відповідає. Якщо ви вийдете з гри до її завершення, ви можете зберегти непройдені запитання, щоб продовжувати відповідати на них пізніше. Для використання додатка необхідно призначити на його запуск жест через меню NVDA>параметри>жести вводу>Тренажер клавіатурних команд.

source: Your Score: %d
ru: Ваши очки: %d
